app/controllers/pins_controller.rb

SELECT "pins".* FROM "pins"  ORDER BY created_at DESC
---
	def index
		@pins = Pin.all.order("created_at DESC")

INSERT INTO "pins" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Pin"], ["description", "Testing"], ["created_at", "2015-05-02 09:59:18.450988"], ["updated_at", "2015-05-02 09:59:18.450988"]]
---
	def create
		@pin = Pin.new(pin_params)

		if @pin.save

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_pin
		@pin = Pin.find(params[:id])